Repository: 84000/data-translation-memory
Catalog: Toh_247-Distinguishing_Phenomena_and_What_Is_Meaningful-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying in the Jeta Grove, Anāthapiṇḍada’s park in Śrāvastī.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་ཡང་ཐབས་ཅིག་གོ།
en: He was there together with a great saṅgha of monks, as well as a great saṅgha of bodhisattvas.

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་ཅིང་ཚད་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་གི་འབྱུང་གནས་ཞེས་བྱ་བ་འབྱོར་པ་རྒྱས་པ།
en: “Noble son, at a past time countless, limitless, immeasurably many eons ago, there was a world called Flower Origin.

source: བདེ་བ་ལོ་ལེགས་པ་ཉམས་དགའ་བ་སྐྱེ་བོ་མང་པོ་དང་མི་རྣམས་ཀྱིས་གང་བ་ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ་ཞིག་བྱུང་ངོ་། །
en: It was abundantly prosperous and happy, had good crops, and was delightful. It was filled with many people, and was as even as the palm of a hand.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་གི་འབྱུང་གནས་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ལས་བྱུང་བ་ཞེས་བྱ་བ་ད་ལྟར་ཡང་བཞུགས་ཏེ།
en: Noble son, in the world Flower Origin dwelled the thus-gone, worthy, perfect buddha Arisen from Flowers.

source: འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: He still abides there, alive and well, teaching the Dharma to the fourfold assembly, as well as to gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, humans, and non-humans.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་གི་འབྱུང་གནས་དེ་ན་མིའི་དབང་པོ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལ་དབང་བྱེད་པ་རྒྱལ་བ་ཐོབ་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Noble son, in the world Flower Origin lived the ruler Attainment of Victory. He was a universal emperor, who had as his dominion the entire trichiliocosm.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་དེའི་ཚིག་རབ་ལ་སེམས་ཅན་དེ་དག་བདེ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ལ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་ཞིང་བདག་གི་ཆུང་མས་མངོན་པར་དགའོ། །
en: Noble son, under the king’s rule beings had found happiness and well-being, followed the path of the ten virtuous deeds, and were satisfied with their spouses.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་གཅིག་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་སྟེ། འདི་ལྟ་སྟེ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: Everyone there had entered but a single vehicle: they had entered the Great Vehicle.

source: ཐེག་པ་མཆོག་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the supreme vehicle.

source: ཐེག་པ་གཙོ་བོ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the main vehicle.

source: ཐེག་པ་དམ་པ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the true vehicle.

source: ཐེག་པ་ཁྱད་པར་དུ་འཕགས་པ་དང་། རབ་དང་། ཕུལ་དང་། བླ་མ་དང་། བླ་མའི་ཡང་བླ་མ་དང་། བླ་ན་མེད་པ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the foremost vehicle—the best, the finest, and the highest vehicle. The vehicle they had entered was higher than the highest: the unsurpassed vehicle.

source: ཐེག་པ་མཉམ་པ་མེད་པ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the unequaled vehicle.

source: ཐེག་པ་མི་མཉམ་པ་དང་མཉམ་པ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the matchless vehicle.

source: ཐེག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: They had entered the inconceivable vehicle.

source: ཐེག་པ་གཞལ་དུ་མེད་པ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་གོ།
en: They had entered the unfathomable vehicle.

source: ཐེག་པ་གཞལ་དུ་མེད་པ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་གོ། །
en: They had entered the unfathomable vehicle.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་དེའི་ཚེ་ཚིག་རབ་ལ་ཐེག་པ་ཆེན་པོ་མ་གཏོགས་པར་ཐེག་པ་གཞན་གྱི་མིང་ཡང་མི་གྲག་གོ། །
en: Noble son, under the rule of that king Attainment of Victory, vehicles other than the Great Vehicle were unheard of.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་དེའི་བཙུན་མོའི་འཁོར་ནི་དགུ་ཁྲི་དགུ་སྟོང་ཡོད་དེ། དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་གཞན་མ་ཡིན་པ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: “Noble son, in his retinue of queens King Attainment of Victory had ninety-nine thousand wives, none of whom had entered any other vehicle.

source: ཐེག་པ་ཆེན་པོའི་ཁོངས་སུ་འདུས་པ། ཉིན་མཚན་དུ་ཆོས་འདོད་ཅིང་ཆོས་ལ་དགའ་བ་ཤ་སྟག་གོ། །
en: They all belonged solely to the Great Vehicle, longed for the Dharma day and night, and took delight in the Dharma.

source: རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་དེའི་བཙུན་མོ་དམ་པ་རིན་པོ་ཆེ་དཔལ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སྡུད་པ། སངས་རྒྱས་པའི་ཆོས་དང་དགེ་འདུན་ལ་ཡང་དག་པར་ཞུགས་པ།
en: Noble son, that king’s primary wife Ratnaśrī, who was a beloved bodhisattva, followed the Buddha, the Dharma, and the Saṅgha.

source: ཐེག་པ་ཆེན་པོའི་ཁོངས་སུ་འདུས་པ། ཉིན་མཚན་དུ་ཆོས་འདོད་པ། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བ་ཞིག་ཡོད་དེ།
en: She belonged to the Great Vehicle, longed for the Dharma at all times, and found delight only in the joy of the Dharma.

source: རིགས་ཀྱི་བུ་རིན་ཆེན་དཔལ་དེ་ཆེན་པོ་ལ་འོས་པའི་སེང་གེའི་ཁྲི་ལ་འདུག་པ་དང་། དེའི་པང་ནས་བུ་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བ་ལྷའི་རྒྱན་གྱིས་རྣམ་པར་བརྒྱན་པ།
en: “Noble son, once, while Ratnaśrī was seated upon a splendid lion throne, her son Ratnākara got down from her lap where he had been sitting in the cross-legged posture.

source: དེ་ནས་རྒྱལ་མོ་རིན་ཆེན་དཔལ་དེས་གཞོན་ནུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The queen Ratnaśrī answered the young child:

source: ཡུམ་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ལས་བྱུང་བ་དེ་འཚོའམ།
en: ‘Mother, is the thus-gone Arisen from Flowers still alive?’

source: ལྷའི་གོས་བགོས་པ་ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལེགས་པར་བརྒྱན་པ་ཞིག་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བྱུང་ནས་གཞོན་ནུ་དེ་བྱུང་མ་ཐག་ཏུ་གཞོན་ནུ་དེས་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He was adorned with divine ornaments, attired with divine fabrics, and his body was adorned with the excellent major and minor marks. As soon as he got down, the child asked his mother,

source: བུ་གཅིག་ཀུན་མཁྱེན་འཇིག་རྟེན་མགོན། །བླ་ན་མེད་པ་དགའ་མཛད་པ། །ལྷ་དང་མི་དང་བཅས་པ་ཡི། །འཇིག་རྟེན་ན་ནི་དེ་འཚོའོ། །
en: “ ‘My only son, the omniscient one, The protector of the world, The unsurpassed one who delights all— He is alive in the world of gods and humans.’

source: དེ་ནས་རྒྱལ་བུ་རིན་ཆེན་འབྱུང་གནས་ཀྱིས་ཕ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The prince Ratnākara then said to his parents,

source: ཡབ་ཡུམ་ཚུར་གཤེགས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ལས་བྱུང་བ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། ཆོས་མཉན་པའི་སླད་དུ་གཤེགས་སོ། །
en: ‘Father and Mother, come here! We must go to the thus-gone, worthy, perfect buddha Arisen from Flowers in order to behold him, to pay homage and make offerings, to serve him, and to receive Dharma teachings from him.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། ཡབ་ཡུམ་དེ་བཞིན་གཤེགས་པ་དེ་ནི་ལྷ་དང་མིར་བཅས་པའི་འཇིག་རྟེན་ན་དཀའ་བ་མཛད་པ་སྟེ།
en: If you wonder why we need to do so, Father and Mother, it is because the Thus-Gone One performs hardships in the world of gods and humans. “

source: མ་གྲོལ་བ་རྣམས་གྲོལ་མཛད་མགོན། །
en: ‘He is a protector liberating those who have not been liberated.

source: ལྡོངས་པ་རྣམས་ལ་མིག་སྦྱིན་མཛད། །
en: He grants eyesight to the blind.

source: ལྷུན་པོ་ལྟ་བུར་མི་གཡོས་སོ། །
en: He is as unwavering as a great mountain.’

source: ཆོས་ལ་དཔའ་ཞིང་ཆེར་དཔའ་བ། །
en: He is heroic and courageous with regard to the Dharma.

source: དེ་ནས་རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་དང་། རྒྱལ་མོ་རིན་ཆེན་དཔལ་གྱིས་བུ་དེ་བླངས་ཏེ། བཙུན་མོའི་འཁོར་དང་གཡོག་ཏུ་བཅས་པར་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ཀྱི་དྲུང་དུ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ། བརྒྱ་སྟོང་རི་བའི་མུ་ཏིག་གི་སེ་མོ་དོ་ཕུལ་ལོ། །ཕུལ་ནས་ཀྱང་འཁོར་དེ་ཉིད་དུ་འདུག་པར་གྱུར་ཏོ། །
en: “King Attainment of Victory and Queen Ratnaśrī then brought their son and the retinue of queens and servants and went before that blessed one. They circumambulated that blessed one seven times and offered him extremely valuable pearl necklaces, after which they all sat down among the assembly.

source: རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་བུ་དེས་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་བྱས་ནས་ཤིང་ཏ་ལ་བདུན་སྲིད་ཙམ་གྱི་བར་སྣང་གི་ནམ་མཁའ་ལ་འདུག་སྟེ། བཅོམ་ལྡན་འདས་མེ་ཏོག་ལས་བྱུང་བ་དེ་ལ་རིན་པོ་ཆེའི་ཆར་དང་། མེ་ཏོག་གི་ཆར་དང་། སྤོས་ཀྱི་ཆར་རྣམས་ཀྱིས་གཏོར་མངོན་པར་གཏོར་ཏོ། །
en: Noble son, the prince then rose up into the sky to the height of seven palm trees by means of his miraculous ability, and showered upon the blessed Arisen from Flowers a rain of jewels, flowers, and incense.

source: གཏོར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He then proclaimed to that blessed one:

source: བདག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཁྱོད། །བལྟ་བའི་སླད་དུ་འདིར་མཆིས་སོ། །
en: I have come here to see you, Omniscient One.

source: སྟོན་པ་རྒལ་ནས་སེམས་ཅན་རྣམས། །སྡུག་བསྔལ་ཆུ་བོ་ཆེ་ལས་སྒྲོལ། །
en: “ ‘O Teacher, you have crossed The great river of suffering, And ferry beings across it.

source: སེམས་ཅན་ཤུལ་ངན་ལྷུང་གྱུར་ཅིང་། །འདོད་ཆགས་ཞེ་སྡང་དབང་མཆིས་རྣམས། །ཐེག་པ་དམན་ལ་གཞག་མཛད་ནས། །ཐེག་པ་ཆེན་པོ་བརྗོད་པར་མཛད། །
en: “ ‘You establish in the Lesser Vehicle Beings who have strayed onto negative paths, Those who are under the sway of desire and anger, And then you teach the Great Vehicle. “

source: ཐབས་ལ་མཁས་ཤིང་དཔའ་བ་སྟེ། །ཐུགས་རྗེ་ཆེན་པོའི་དབང་དུ་གྱུར། །
en: ‘You are skilled in means and courageous, A master of great compassion.

source: ཆོས་ནི་དོན་ཏེ་ཆོས་ཀྱིས་ངོམས། །
en: The Dharma is meaningful and you are sated by the Dharma;

source: ཆོས་རྩོམ་ཡོན་ཏན་འབྱུང་གནས་པོ། །
en: You set forth the Dharma and are a source of all qualities. “

source: གང་དག་སྐྱེ་བ་མ་མཆིས་པ། །ཆོས་དེ་སྙིང་པོ་མེད་མཁྱེན་ནས། །ཆོས་ཉིད་ཀྱང་ནི་ཁྱོད་ཀྱིས་མཁྱེན། །
en: ‘Also, knowing phenomena to be unborn And without substance, You know their true nature.

source: དེས་ན་ཁྱོད་ཀྱིས་དཀའ་བ་མཛད། །
en: That is how you perform hardships.’

source: དེ་ནས་གཞོན་ནུ་དེས་ཚིག་འདི་དག་གིས་བཅོམ་ལྡན་འདས་དེ་ལ་བསྟོད་ནས་ཡང་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་འདུག་གོ། །
en: “The young prince praised that blessed one in this manner, then circumambulated him and sat before him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་པད་མའི་འདབ་མ་ལྟར་ཡངས་པའི་སྤྱན་གྱིས་ཕྱོགས་ཐམས་ཅད་དུ་གཟིགས་ཏེ།
en: “The Blessed One looked in all directions with his broad eyes, which resembled the petals of a lotus flower.

source: འཁོར་བཞི་པོ་དེ་དག་གི་སེམས་དང་སེམས་ལས་བྱུང་བ་མཁྱེན་ནས། རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Knowing the minds and mental states of the fourfold assembly, he said to King Attainment of Victory:

source: འཇིག་རྟེན་མགོན་པོ་བླ་ན་མེད། །ལྷ་དང་མི་ཡི་འཇིག་རྟེན་ན། །ཁྱོད་ཀྱིས་ཡོན་ཏན་གང་བསྟན་དང་། །ཁྱོད་འདྲ་བ་ནི་ཡོང་མ་མཆིས། །
en: “ ‘As the unsurpassed protector of the world, There is no one who has ever matched you, Or displayed such qualities as yours, In the world of gods and humans.

source: རྒྱལ་པོ་ཆེན་པོ་ཕུང་པོ་ལྔ་པོ་དེ་དག་ནི་སྙིང་པོ་མེད་པ་ཡིན་ན་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་སྙིང་པོར་འདུ་ཤེས་སོ། །
en: “ ‘Great King, although the five aggregates are insubstantial, childish ordinary beings think of them as being substantial.

source: རྒྱལ་པོ་ཆེན་པོ་ཕུང་པོ་རྣམས་ནི་ཁ་དོག་ངན་པ། དྲི་ང་བ། ཁྲག་དང་རྣག་འབྱུང་བ། ཤིང་དང་། བོང་བ་དང་། ལམ་དང་མཚུངས་པ། སྙིང་པོ་མེད་པ། གཡོ་བ་མེད་པ་དང་། དགའ་བ་དང་མི་དགའ་བར་འབྲེལ་བ།
en: Great King, the aggregates look awful; they smell terrible; they ooze pus and blood; they are like wood, clods of dirt, or roads; and they are insubstantial, inert, and interlinked with joy and sorrow.

source: སྨད་པ་ཡིན་ན་སྙིང་པོ་མེད་པ་ལ་སྙིང་པོར་འདུ་ཤེས།
en: Still, ordinary beings think that such insubstantial things are substantial;

source: སྲེད་པའི་ལུ་གུ་རྒྱུད་ཀྱིས་ཕན་ཚུན་སྦྲེལ་བ། ཉོན་མོངས་པ་མང་བ།
en: They are linked to each other by chains of craving, are full of affliction, and are vile.

source: མི་རྟག་པ་ལ་རྟག་པར་འདུ་ཤེས། མི་སྡུག་པ་ལ་སྡུག་པར་འདུ་ཤེས། མི་གཙང་བ་ལ་གཙང་བར་འདུ་ཤེས། བདེན་པ་མ་ཡིན་པ་ལ་བདེན་པར་འདུ་ཤེས་སོ། །
en: they think that impermanent things are permanent, repulsive things are beautiful, unclean things are clean, and unreal things are real.

source: རྒྱལ་པོ་ཆེན་པོ་ཕུང་པོ་ལྔ་ནི་རང་གི་ལས་ཀྱིས་རྣམ་པར་བྲིས་པ་སྟེ་རྒྱལ་པོ་ཆེན་པོ་དཔེར་ན་རྨ་བྱའི་མཇུག་ཚོགས་ཚོན་སྣ་ལྔ་པ་དེ་ལ་རི་མོ་མཁན་གྱིས་བྲིས་པ་ཡང་མེད། ཚོན་ཀྱང་ཅི་ཡང་མེད་དེ།
en: Great King, the five aggregates are “painted” by one’s own karma. As an analogy, O Great King, there is no painter who paints the peacock’s five-colored tail, and neither is there any paint involved.

source: དེ་ནི་རང་གི་ལས་ཀྱིས་རྣམ་པར་བྲིས་པ་ཉིད་དོ། །
en: Rather, it is painted by the peacock’s own karma.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་དུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱང་རང་གི་ལས་ཀྱིས་རྣམ་པར་བྲིས་པ་ཕན་ཚུན་གྱི་རྐྱེན་ལས་བྱུང་བ་དག་གོ། །
en: Great King, in the same way, childish ordinary beings arise from reciprocal conditions, painted by their own karma.’“

source: དེ་ནས་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་ཕམ་དབང་ཕྱུག་ཅེས་བྱ་བ་དེ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་བསྐོར་བ་བྱས་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་ལུས་བཏུད་ལུས་སྨད་དེ་སོར་མོ་བཅུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point the bodhisattva great being Invincible Lord stood up among the assembly, circumambulated the Blessed One, draped his shawl over one shoulder, knelt down on his right knee, and bowed with joined palms.

source: བཅོམ་ལྡན་འདས་ཕུང་པོ་འདི་དག་ནི་ཁ་དོག་ངན་པ་དྲི་ང་བ། ཁྲག་དང་རྣག་འབྱུང་བ། ཤིང་དང་། བོང་བ་དང་། རྩིག་པ་དང་། ལམ་དང་འདྲ་བ། སྙིང་པོ་མ་མཆིས་པ།
en: “He said to the Blessed One, ‘Blessed One, these aggregates do look awful and smell terrible; they ooze blood and pus; they are like wood, clods of dirt, walls, or roads; they are insubstantial and inert.

source: གཡོ་བ་མ་མཆིས་པ་ལགས་ན་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་སྙིང་པོར་འདུ་ཤེས་ཏེ། ཡང་དག་པ་མ་ལགས་པ་ལྡོངས་པ།
en: Childish ordinary beings think that these things have substance, but these beings are like the mistaken, the blind, and the confused.

source: རྨོངས་པ་དང་འདྲ་བ།
en: They have fallen into bewilderment.

source: གཏི་མུག་ལ་གཞོལ་བ། མུན་པ་དང་རབ་རིབ་དང་། ལིང་ཏོག་གིས་ཀུན་ནས་ཁེབས་པ།
en: They are completely enveloped in darkness, obscurity, and veils.

source: ལྟ་བ་ཐམས་ཅད་ཀྱི་ཚང་ཚིང་ཐིབས་པོས་གཏིབས་པ་ལགས་སོ། །
en: They are lost in the dense thicket of all their wrong views.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་ཕུང་པོ་བཞི་པོ་འདི་དག་ནི་ཟབ་སྟེ། ནམ་མཁའ་དང་མཚུངས་ཤིང་འདྲ་བ་ལགས་སོ། །
en: Blessed One, these four collections of the Dharma are all profound; they are like space.

source: བཅོམ་ལྡན་འདས་གང་དག་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཚིག་བཤད་པ་འདི་དག་ལ་ཡང་དག་པའི་འདུ་ཤེས་སྐྱེད་པའི་སེམས་ཅན་དེ་དག་འབྱུང་བར་འགྱུར་ལགས་སམ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed One, will any beings ever come to understand correctly the statements that are spoken in discourses such as this?’

source: བཅོམ་ལྡན་འདས་མེ་ཏོག་ལས་བྱུང་བ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབྱུང་བ་དེའི་ཚེ་སེམས་ཅན་རྣམས་སྦྱང་བའི་ཕྱིར་འབྱུང་སྟེ།
en: “The blessed Arisen from Flowers answered that bodhisattva great being, ‘Noble son, whenever bodhisattva great beings manifest, it will be in order to purify beings.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: They teach them the Dharma in accordance with their inclinations.

source: སྲེད་པས་ཉམ་ཐག་པ་རྣམས་ཀྱི་སྲེད་པ་གཅོད་དོ། །
en: They cut through the cravings of those who are tormented by craving.

source: སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་པ་རྣམས་ཀྱི་མྱ་ངན་སེལ་ཏོ། །
en: They clear away the suffering of those tormented by pain.

source: ཆོས་ཐམས་ཅད་སྙིང་པོ་མེད་པར་ཤེས་ཏེ་ནམ་མཁའ་དང་མཚུངས་ཤིང་འདྲ་བར་ཤེས་ནས་སེམས་ཅན་རྣམས་ཆོས་ཉིད་ལ་རབ་ཏུ་འགོད་དེ།
en: Knowing all phenomena to be insubstantial and knowing them to be like space, they direct sentient beings to the nature of phenomena.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་སྦྱོང་བར་བྱེད་པ་ཞེས་བྱའོ། །
en: Bodhisattvas are then known as purifiers of beings.’“

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ལས་བྱུང་བ་དེས་སེམས་ཅན་བསྟན་པ་འདི་བཤད་པ་ན་རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་བུ་དང་བཅས་པ་དང་། རྒྱལ་མོ་རིན་ཆེན་དཔལ་དེ་དང་། བཙུན་མོའི་འཁོར་དང་། གཡོག་འཁོར་དུ་བཅས་པ་ཐམས་ཅད་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་བཅོམ་ལྡན་འདས་དེ་ལས་རབ་ཏུ་བྱུང་ངོ་། །
en: When that blessed, thus-gone, worthy, perfect buddha Arisen from Flowers had delivered this teaching concerning sentient beings, King Attainment of Victory cut off his hair and beard. His son, as well as Queen Ratnaśrī and the retinue of queens and servants, likewise all cut off their hair and they all took ordination with the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “The Blessed One now spoke to the assembly:

source: རིགས་ཀྱི་བུ་དག་རྒྱལ་བུ་གཞོན་ནུ་འདི་ལ་ལྟོས།
en: ‘Noble children, look at the young prince.

source: ཐམས་ཅད་དུ་ཡང་ཆོས་སྨྲ་བར་གྱུར་ཏོ།
en: On all of these occasions he has become a Dharma preacher.

source: རིགས་ཀྱི་བུ་དག་སྐྱེས་བུ་དམ་པ་འདིས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ། །
en: Noble children, this sublime being has produced roots of virtue in the company of ninety-nine trillion buddhas.

source: འདི་ནི་རྟག་ཏུ་སྐྱེས་བུ་དམ་པ་འདིའི་ཕར་གྱུར་ཏེ།
en: And this person here has always been the father of that sublime being.

source: རྟག་ཏུ་སྐྱེས་བུ་དམ་པ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: This sublime being has always ripened beings to unsurpassed and perfect awakening.

source: རིགས་ཀྱི་བུ་དག་རྒྱལ་བུ་གཞོན་ནུ་རིན་ཆེན་འབྱུང་གནས་འདི་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་མ་ཐག་ཏུ་སངས་རྒྱས་སུ་འགྱུར་ཏེ།
en: Noble children, as soon as I pass into parinirvāṇa, the young prince Ratnākara will become a buddha.

source: རིན་པོ་ཆེ་དུ་མ་བཀོད་པའི་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་འདུག་ནས།
en: He will be seated in front of the tree of awakening, which will be bedecked with various precious stones.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: When he attains awakening, he will become a thus-gone, worthy, perfect buddha.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་ཟེར་ཀུན་ནས་མངོན་འཕགས་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: He will be someone learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans, a blessed buddha known as Splendorous King of Shining Light.

source: འཇིག་རྟེན་གྱི་ཁམས་ནི་ཀུན་ནས་རིན་པོ་ཆེས་ཡང་དག་པར་བྲིས་པ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: His world will be known as Painted with Many Jewels.

source: དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་ཚད་མེད་པར་འགྱུར་རོ། །
en: He will have an immeasurable saṅgha of hearers.

source: དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཐུབ་པར་འགྱུར་རོ། །
en: He will have a lifespan of ninety-six trillion eons.

source: དེའི་དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་ནི་ལོ་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་ལྔར་གནས་པར་འགྱུར་རོ། །
en: The appearance of his sacred Dharma will remain for seven million five hundred thousand years.’“

source: རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུང་བསྟན་པ་བརྗོད་པ་བཤད་པ་ན་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Noble son, at that time, when the prophecy concerning that bodhisattva great being was made, eighty-four thousand beings gained acceptance that phenomena are unborn.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། །
en: Why so?

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཚོམ་ཟའམ་ཡིད་གཉིས་སུ་གྱུར་ན་དེ་ལྟར་མི་བལྟའོ།
en: Noble son, should you wonder, question, or have doubts regarding the identity of the thus-gone one of that time, there is no need.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཅེས་བྱ་བ་འདི་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ལས་བྱུང་བ་ཞེས་བྱ་བར་གྱུར་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེར་ཆོས་བསྟན་པར་གྱུར་ཏོ། །
en: Noble son, it is the thus-gone, worthy, perfect buddha Amitābha who was known at that time as the thus-gone Arisen from Flowers and who taught the Dharma in that world.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་གཞོན་ནུ་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟའམ་ཡིད་གཉིས་སུ་གྱུར་ན་དེ་ལྟར་མི་བལྟའོ།
en: Noble son, should you wonder, question, or have doubts regarding the identity of the prince known as Ratnākara at that time, there is no need.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འདི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རྒྱལ་བ་ཐོབ་པ་ཞེས་བྱ་བ་དེའི་བུར་གྱུར་ཏེ།
en: Noble son, it is the bodhisattva Avalokiteśvara who was at that time the son of King Attainment of Victory.

source: དེ་བཞིན་གཤེགས་པ་དེས་ང་ལས་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: That thus-gone one prophesied, ‘He will gain awakening from me.’

source: དེ་ནས་འཁོར་དེའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་དགའ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: ” The bodhisattva great being Delighted by Victory, who was among the retinue, now joined his palms and asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ཀྱི་རྣ་ལམ་དུ་གྲག་པར་ཡང་མི་འགྱུར་ན། གང་དག་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་། འཛིན་པ་དང་། ཁ་ཏོན་བགྱིད་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་རྣམས་ཀྱིས་མཆོད་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། །
en: “Blessed One, will beings who have not produced roots of virtue ever even hear this Dharma teaching, let alone commit it to writing, commission it to be written, retain it, recite it, or offer flowers, incense, and incense powder to it?”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ཀྱི་རྣ་ལམ་དུ་གྲག་པར་ཡང་མི་འགྱུར་ན། གང་དག་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་། འཛིན་པ་དང་། ཁ་ཏོན་བགྱིད་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་རྣམས་ཀྱིས་མཆོད་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: “Blessed One, will beings who have not produced roots of virtue ever even hear this Dharma teaching, let alone commit it to writing, commission it to be written, retain it, recite it, or offer flowers, incense, and incense powder to it?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་དགའ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the bodhisattva great being Delighted by Victory,

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དག་གང་གི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་ལ་ཐེ་ཚོམ་མི་ཟ་བའི་སེམས་ཅན་དེ་དག་འདི་ནས་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: Noble son, those sentient beings who hear this Dharma teaching and do not doubt it will be reborn in the realm of Sukhāvatī after they die and pass from this world.

source: རིགས་ཀྱི་བུ་གང་ན་མདོ་སྡེ་འདི་ལྟ་བུ་དག་འཛིན་པའི་ས་ཕྱོགས་དེ་དག་ཕྱག་བྱ་བའི་འོས་སུ་འགྱུར་རོ། །
en: Noble son, any place where this discourse is kept will become worthy of homage.

source: རིགས་ཀྱི་བུ་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ན་བུད་མེད་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་ངམ། ཀློག་ན་དེ་བུད་མེད་ཀྱི་ལུས་རྗེས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ། །
en: Noble son, later, in the future, any woman who holds or reads aloud this Dharma teaching will exchange her female body and be reborn in the realm of Sukhāvatī.

source: འཆི་བའི་དུས་ཀྱི་ཚེ་ན་ཡང་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་མཐོང་བར་འགྱུར་རོ། །
en: She will, moreover, behold the thus-gone Amitābha at the moment of death.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Once the Blessed One had spoken, the bodhisattva great being Delighted by Victory, the other bodhisattvas, the monks, and the rest of the assembly, along with the world with its gods, humans, demigods, and gandharvas, all rejoiced and praised what the Blessed One had said.
